using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using WinChurchPlayVideo.Common;

namespace WinChurchPlayVideo.Helper
{
    public class DropDownListHelper
    {
        /// <summary>
        /// 取得所有區域名單
        /// </summary>
        /// <returns></returns>
        public static List<ListItem> GetArea()
        {
            string[] Areas = "中區,東區,西區,南區,北區,西屯區,南屯區,北屯區,豐原區,大里區,太平區,清水區,沙鹿區,大甲區,東勢區,梧棲區,烏日區,神岡區,大肚區,大雅區,后里區,霧峰區,潭子區,龍井區,外埔區,和平區,石岡區,大安區,新社區".Split(',');

            var GroupListItem = new List<ListItem>();

            for (int i = 0; i < Areas.Length; i++)
            {
                GroupListItem.Add(new ListItem { Text = Areas[i], Value = i.ToString() });
            }

            return GroupListItem;
        }

        public static List<ListItem> GetAllNames()
        {

            var GroupNameItem = new List<ListItem>();


            string[] values = "趙,錢,孫,李,周,吳,鄭,王,馮,陳,褚,衛,蔣,沈,韓,楊,朱,秦,尤,許,何,呂,施,張,孔,曹,嚴,華,金,魏,陶,姜,戚,謝,鄒,喻,柏,水,竇,章,雲,蘇,潘,葛,奚,范,彭,郎,魯,韋,昌,馬,苗,鳳,花,方,俞,任,袁,柳,酆,鮑,史,唐,費,廉,岑,薛,雷,賀,倪,湯,滕,殷,羅,畢,郝,鄔,安,常,樂,于,時,傅,皮,卞,齊,康,伍,余,元,卜,顧,孟,平,黃,和,穆,蕭,尹,姚,邵,湛,汪,祁,毛,禹,狄,米,貝,明,臧,計,伏,成,戴,談,宋,茅,龐,熊,紀,舒,屈,項,祝,董,梁,杜,阮,藍,閔,席,季,麻,強,賈,路,婁,危,江,童,顏,郭,梅,盛,林,刁,锺,徐,邱,駱,高,夏,蔡,田,樊,胡,凌,霍,虞,萬,支,柯,昝,管,盧,莫,經,房,裘,繆,干,解,應,宗,丁,宣,賁,鄧,郁,單,杭,洪,包,諸,左,石,崔,吉,鈕,龔,程,嵇,邢,滑,裴,陸,榮,翁,荀,羊,於,惠,甄,麴,家,封,芮,羿,儲,靳,汲,邴,糜,松,井,段,富,巫,烏,焦,巴,弓,牧,隗,山,谷,車,侯,宓,蓬,全,郗,班,仰,秋,仲,伊,宮,甯,仇,欒,暴,甘,鈄,厲,戎,祖,武,符,劉,景,詹,束,龍,葉,幸,司,韶,郜,黎,薊,薄,印,宿,白,懷,蒲,邰,從,鄂,索,咸,籍,賴,卓,藺,屠,蒙,池,喬,陰,鬱,胥,能,蒼,雙,聞,莘,黨,翟,譚,貢,勞,逄,姬,申,扶,堵,冉,宰,酈,雍,郤,璩,桑,桂,濮,牛,壽,通,邊,扈,燕,冀,郟,浦,尚,農,溫,別,莊,晏,柴,瞿,閻,充,慕,連,茹,習,宦,艾,魚,容,向,古,易,慎,戈,廖,庾,終,暨,居,衡,步,都,耿,滿,弘,匡,國,文,寇,廣,祿,闕,東,歐,殳,沃,利,蔚,越,夔,隆,師,鞏,厙,聶,晁,勾,敖,融,冷,訾,辛,闞,那,簡,饒,空,曾,毋,沙,乜,養,鞠,須,豐,巢,關,蒯,相,查,后,荊,紅,游,竺,權,逯,蓋,益,桓,公,万,俟,司,馬,上,官,歐,陽,夏,侯,諸,葛,聞,人,東,方,赫,連,皇,甫,尉,遲,公,羊,澹,臺,公,冶,宗,政,濮,陽,淳,于,單,于,太,叔,申,屠,公,孫,仲,孫,軒,轅,令,狐,鍾,離,宇,文,長,孫,慕,容,鮮,于,閭,丘,司,徒,司,空,亓,官,司,寇,仉,督,子,車,顓,孫,端,木,巫,馬,公,西,漆,雕,樂,正,壤,駟,公,良,拓,跋,夾,谷,宰,父,穀,梁,晉,楚,閆,法,汝,鄢,涂,欽,段,干,百,里,東,郭,南,門,呼,延,歸,海,羊,舌,微,生,岳,帥,緱,亢,況,後,有,琴,梁,丘,左,丘,東,門,西,門,商,牟,佘,佴,伯,賞,南,宮,墨,哈,譙,笪,年,愛,陽,佟".Split(',');

            foreach (var item in values)
            {
                GroupNameItem.Add(new ListItem { Value = item, Text = item });
            }

            return GroupNameItem;
        }
    }
}
